src/cf/InformationRegisters/СопутствующиеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СопутствующиеТовары</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_ПроцентСлучаев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_КоличествоСлучаев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СопутствующийТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДобавленоАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ор_СопутствующиеТоварыВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет обновление записей в регистре
//
Функция ОбновитьДанныеОНоменклатуреПродаваемойСовместно() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьЗаписиРегистра(
		ВыполнитьПоискАссоциаций(ИсточникДанныхДляАнализаРозничнойТорговли())
	);
	
КонецФункции

// Функция устанавливает значения констант поиска совместной номенклатуры начальными значениями
//
Функция УстановитьЗначенияКонстантПоУмолчанию() Экспорт
	
	Константы.ор_МинимальнаяДостоверностьСопутствующихТоваров.Установить(60);
	Константы.ор_МинимальнаяЗначимостьСопутствующихТоваров.Установить(10);
	Константы.ор_МинимальныйПроцентСлучаевСопутствующихТоваров.Установить(0);
	Константы.ор_КоличествоПериодовДляАнализаСопутствующихТоваров.Установить(1);
	Константы.ор_ПериодичностьДляАнализаСопутствующихТоваров.Установить(Перечисления.Периодичность.Год);
	
КонецФункции

// Рассчитывает дату окончания периода
//
// Параметры:
// ДатаНачала          - дата начала, от которой будет рассчитана дата окончания периода
// Периодичность      - значение перечисления "Периодичность"
// КоличествоПериодов - количество повторов периода
//
// Возвращаемое значение:
// Дата
// Дата окончания периода
//
Функция РассчитатьДатуОкончанияПериода(ДатаНачала, Периодичность, КоличествоПериодов) Экспорт
	
	ОдинДень = 86400;
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда 
		
		ДатаОкончания = ДатаНачала + ОдинДень * КоличествоПериодов;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		
		ДатаОкончания = ДатаНачала + ОдинДень * 7 * КоличествоПериодов;
		
	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада")) Тогда
		
		ДеньМесяца = День(ДатаНачала);
		НачМесяца = НачалоМесяца(ДатаНачала);
		Если ДеньМесяца <= 10 Тогда
			НомерДекады = 1;
		ИначеЕсли ДеньМесяца <= 20 Тогда
			НомерДекады = 2;
		Иначе
			НомерДекады = 3;
		КонецЕсли;
		
		НомерДекады = НомерДекады + КоличествоПериодов;
		
		Если НомерДекады > 0 Тогда
			Месяцев = Цел((НомерДекады-1)/3);
		Иначе
			Месяцев = -1 - Цел((-НомерДекады)/3);
		КонецЕсли;
		
		НомерДекады = НомерДекады - 3*Месяцев;
		Дт = ДобавитьМесяц(НачМесяца, Месяцев) + (НомерДекады-1) * 10 * ОдинДень;
		
		Если КоличествоПериодов > 0 Тогда
			ДатаОкончания = Дт;
			
		Иначе 
			ДеньМесяца = День(Дт);
			
			Если ДеньМесяца <= 10 Тогда
				ДатаОкончания = КонецДня(НачалоМесяца(Дт) + ОдинДень * 9);
			ИначеЕсли ДеньМесяца <= 20 Тогда
				ДатаОкончания = КонецДня(НачалоМесяца(Дт) + ОдинДень * 19);
			Иначе
				ДатаОкончания = КонецМесяца(Дт);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли (Периодичность= ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, КоличествоПериодов);
		
	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 3 * КоличествоПериодов);
		
	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 6 * КоличествоПериодов);
		
	Иначе // По умолчанию - Год.
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 12 * КоличествоПериодов);
		
	КонецЕсли;
	
	Возврат КонецДня(ДатаОкончания-ОдинДень);
	
КонецФункции // РассчитатьДатуОкончанияПериода()

// Функция получает булево значение установленных констант
//
Функция ВажныеКонстантыСовместныхТоваровУстановлены() Экспорт
	
	КонстантыУстановлены = ИСТИНА;
	
	Если НЕ ЗначениеЗаполнено(Константы.ор_КоличествоПериодовДляАнализаСопутствующихТоваров.Получить()) Тогда
		КонстантыУстановлены = ЛОЖЬ;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ор_ПериодичностьДляАнализаСопутствующихТоваров.Получить()) Тогда
		КонстантыУстановлены = ЛОЖЬ;
	КонецЕсли;
	
	Возврат КонстантыУстановлены;
	
КонецФункции

// Функция получает источник данных для поиска ассоциаций
// 
Функция ИсточникДанныхДляАнализаРозничнойТорговли()
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	ПериодичностьДляАнализаНоменклатурыПродаваемойСовместно = Константы.ор_ПериодичностьДляАнализаСопутствующихТоваров.Получить();
	КоличествоПериодовДляАнализаНоменклатурыПродаваемойСовместно = Константы.ор_КоличествоПериодовДляАнализаСопутствующихТоваров.Получить();
	
	ДатаНачала = РассчитатьДатуОкончанияПериода(
		ТекущаяДатаСеанса(),
		ПериодичностьДляАнализаНоменклатурыПродаваемойСовместно,
		-КоличествоПериодовДляАнализаНоменклатурыПродаваемойСовместно);
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА Товары.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК Товары
	|ГДЕ
	|	Товары.Ссылка.Проведен
	|	И Товары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА Товары.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ");
	
	Запрос.Параметры.Вставить("ДатаНачала", ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	Запрос.Параметры.Вставить("ИспользоватьХарактеристики", ИспользоватьХарактеристики);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция выполняет поиск ассоциаций
//
Функция ВыполнитьПоискАссоциаций(ИсточникДанных)
	
	Анализ = Новый АнализДанных;
	Анализ.ТипАнализа = Тип("АнализДанныхПоискАссоциаций");
	Анализ.ИсточникДанных = ИсточникДанных;
	
	Анализ.НастройкаКолонок.Документ.ТипКолонки       = ТипКолонкиАнализаДанныхПоискАссоциаций.Объект;
	Анализ.НастройкаКолонок.Номенклатура.ТипКолонки   = ТипКолонкиАнализаДанныхПоискАссоциаций.Элемент;
	Анализ.НастройкаКолонок.Характеристика.ТипКолонки = ТипКолонкиАнализаДанныхПоискАссоциаций.Элемент;
	
	Анализ.Параметры.МинимальныйПроцентСлучаев.Значение = Константы.ор_МинимальныйПроцентСлучаевСопутствующихТоваров.Получить();
	Анализ.Параметры.МинимальнаяЗначимость.Значение     = Константы.ор_МинимальнаяЗначимостьСопутствующихТоваров.Получить();
	Анализ.Параметры.МинимальнаяДостоверность.Значение  = Константы.ор_МинимальнаяДостоверностьСопутствующихТоваров.Получить();
	Анализ.Параметры.ТипОтсеченияПравил.Значение = ТипОтсеченияПравилАссоциации.Покрытые;
	
	РезультатАнализа = Анализ.Выполнить();
	
	Возврат РезультатАнализа;
	
КонецФункции

// Функция выполняет обновление записей регистра найденными ассоциациями
//
Функция ОбновитьЗаписиРегистра(РезультатАнализа)
	
	Набор = РегистрыСведений.СопутствующиеТовары.СоздатьНаборЗаписей();
	Набор.Отбор.ДобавленоАвтоматически.Значение = Истина;
	Набор.Отбор.ДобавленоАвтоматически.Использование = Истина;
	
	ТаблицаНабора = Набор.ВыгрузитьКолонки();
	ТаблицаНабора.Индексы.Добавить("Номенклатура");
	ТаблицаНабора.Индексы.Добавить("Характеристика");
	ТаблицаНабора.Индексы.Добавить("СопутствующийТовар");
	ТаблицаНабора.Индексы.Добавить("ХарактеристикаСопутствующегоТовара");
	
	Для Каждого Правило Из РезультатАнализа.Правила Цикл
		
		Если Правило.Предпосылка.Количество() <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Предпосылка Из Правило.Предпосылка Цикл
			
			Для Каждого Следствие Из Правило.Следствие Цикл
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Номенклатура", Предпосылка.Номенклатура.Значение);
				СтруктураОтбора.Вставить("Характеристика", Предпосылка.Характеристика.Значение);
				СтруктураОтбора.Вставить("СопутствующийТовар", Следствие.Номенклатура.Значение);
				СтруктураОтбора.Вставить("ХарактеристикаСопутствующегоТовара", Следствие.Характеристика.Значение);
				
				Если ТаблицаНабора.НайтиСтроки(СтруктураОтбора).Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Запись = ТаблицаНабора.Добавить();
				
				Запись.ДобавленоАвтоматически = Истина;
				
				Запись.Номенклатура                       = Предпосылка.Номенклатура.Значение;
				Запись.Характеристика                     = Предпосылка.Характеристика.Значение;
				Запись.СопутствующийТовар                 = Следствие.Номенклатура.Значение;
				Запись.ХарактеристикаСопутствующегоТовара = Следствие.Характеристика.Значение;
				
				Приоритет = 100 - Цел(Правило.ПроцентСлучаев);
				Запись.Приоритет            = Приоритет;
				Запись.ор_ПроцентСлучаев    = Правило.ПроцентСлучаев;
				Запись.ор_КоличествоСлучаев = Правило.КоличествоСлучаев;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Набор.Загрузить(ТаблицаНабора);
	Набор.Записать();
	
КонецФункции

// Функция получает данные о номенклатуре продаваемой совместно для табличной части.
//
// Параметры:
//  Товары	 - ТаблицаЗначений	 - таблица товаров для которой происходит поиск сопутсвующих товаров.
//     Должна обязательно содержать колонки Номенклатура и Характеристика.
//  СтруктураПараметров - Структура - дополнительные параметры получения данных, содежит значения:
//      - ВидЦены - СправочникСсылка.ВидыЦен - ссылка на розничный вид цен.
//      - ТолькоОстатки - Булево - признак отбора сопутсвующих товаров на остаках.
//      - ТорговыйОбъект - СправочникСсылка.СтруктурныеЕдиницы - ссылка на магазин.
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - данные о сопутсвующих товарах.
//
Функция ПолучитьДанныеОНоменклатуреПродаваемойСовместно(Товары, СтруктураПараметров) Экспорт
	
	// В РМК в форме подбора отображаються только товары с Ценами.
	
	ИспользоватьХарактеристики = ор_ОбщегоНазначенияСервер.ПолучитьНастройкуУчитыватьХарактеристикиПриПодбореСопутствующихТоваров();
	Запрос = Новый Запрос;
	
	Если ИспользоватьХарактеристики Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар КАК СопутствующийТовар,
		|	СопутствующиеТовары.ХарактеристикаСопутствующегоТовара КАК Характеристика,
		|	СопутствующиеТовары.ор_ПроцентСлучаев КАК ПроцентСлучаев,
		|	СопутствующиеТовары.ор_КоличествоСлучаев КАК КоличествоСлучаев,
		|	ЕСТЬNULL(СпрНоменклатура.КатегорияНоменклатуры, &ПустаяКатегория) КАК КатегорияНоменклатуры,
		|	ЕСТЬNULL(СпрНоменклатура.ИспользоватьХарактеристики, ЛОЖЬ)
		|		ИЛИ ЕСТЬNULL(СпрКатегорииНоменклатуры.ИспользоватьХарактеристики, ЛОЖЬ) КАК ИспользоватьХарактеристики
		|ПОМЕСТИТЬ СопутствующиеТовары
		|ИЗ
		|	РегистрСведений.СопутствующиеТовары КАК СопутствующиеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СопутствующиеТовары.СопутствующийТовар = СпрНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК СпрКатегорииНоменклатуры
		|		ПО (СпрНоменклатура.КатегорияНоменклатуры = СпрКатегорииНоменклатуры.Ссылка)
		|ГДЕ
		|	(СопутствующиеТовары.Номенклатура, СопутствующиеТовары.Характеристика) В
		|			(ВЫБРАТЬ
		|				Товары.Номенклатура,
		|				Товары.Характеристика
		|			ИЗ
		|				Товары КАК Товары
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Товары.Номенклатура,
		|				&ПустаяХарактеристика
		|			ИЗ
		|				Товары КАК Товары)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар КАК Номенклатура,
		|	СопутствующиеТовары.СопутствующийТовар КАК Владелец
		|ПОМЕСТИТЬ ВладельцыХарактеристик
		|ИЗ
		|	СопутствующиеТовары КАК СопутствующиеТовары
		|ГДЕ
		|	СопутствующиеТовары.Характеристика = &ПустаяХарактеристика
		|	И СопутствующиеТовары.ИспользоватьХарактеристики
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар,
		|	СопутствующиеТовары.КатегорияНоменклатуры
		|ИЗ
		|	СопутствующиеТовары КАК СопутствующиеТовары
		|ГДЕ
		|	СопутствующиеТовары.Характеристика = &ПустаяХарактеристика
		|	И СопутствующиеТовары.ИспользоватьХарактеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВладельцыХарактеристик.Номенклатура КАК СопутствующийТовар,
		|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаСопутствующегоТовара,
		|	ЕСТЬNULL(СопутствующиеТовары.ПроцентСлучаев, 0) КАК ПроцентСлучаев,
		|	ЕСТЬNULL(СопутствующиеТовары.КоличествоСлучаев, 0) КАК КоличествоСлучаев
		|ПОМЕСТИТЬ ВсеХарактеристикиСопутки
		|ИЗ
		|	ВладельцыХарактеристик КАК ВладельцыХарактеристик
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ВладельцыХарактеристик.Владелец = ХарактеристикиНоменклатуры.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ СопутствующиеТовары КАК СопутствующиеТовары
		|		ПО ВладельцыХарактеристик.Номенклатура = СопутствующиеТовары.СопутствующийТовар
		|			И (СопутствующиеТовары.Характеристика = &ПустаяХарактеристика)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар,
		|	СопутствующиеТовары.Характеристика,
		|	СопутствующиеТовары.ПроцентСлучаев,
		|	СопутствующиеТовары.КоличествоСлучаев
		|ИЗ
		|	СопутствующиеТовары КАК СопутствующиеТовары
		|ГДЕ
		|	(НЕ СопутствующиеТовары.ИспользоватьХарактеристики
		|			ИЛИ СопутствующиеТовары.Характеристика <> &ПустаяХарактеристика)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар,
		|	СопутствующиеТовары.Характеристика,
		|	СопутствующиеТовары.ПроцентСлучаев,
		|	СопутствующиеТовары.КоличествоСлучаев
		|ИЗ
		|	СопутствующиеТовары КАК СопутствующиеТовары
		|ГДЕ
		|	СопутствующиеТовары.ИспользоватьХарактеристики
		|	И СопутствующиеТовары.Характеристика <> &ПустаяХарактеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар КАК Номенклатура,
		|	СопутствующиеТовары.ХарактеристикаСопутствующегоТовара КАК Характеристика,
		|	СопутствующиеТовары.ПроцентСлучаев КАК ПроцентСлучаев,
		|	СопутствующиеТовары.КоличествоСлучаев КАК КоличествоСлучаев
		|ИЗ
		|	ВсеХарактеристикиСопутки КАК СопутствующиеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопутствующиеТовары.СопутствующийТовар            КАК Номенклатура,
		|	СРЕДНЕЕ(СопутствующиеТовары.ор_ПроцентСлучаев)    КАК ПроцентСлучаев,
		|	СРЕДНЕЕ(СопутствующиеТовары.ор_КоличествоСлучаев) КАК КоличествоСлучаев
		|ИЗ
		|	РегистрСведений.СопутствующиеТовары КАК СопутствующиеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	СопутствующиеТовары.Номенклатура В
		|			(ВЫБРАТЬ
		|				Товары.Номенклатура
		|			ИЗ
		|				Товары КАК Товары)
		|	И ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность
		|
		|СГРУППИРОВАТЬ ПО
		|	СопутствующиеТовары.СопутствующийТовар";
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ТолькоОстатки") И СтруктураПараметров.ТолькоОстатки Тогда
		
		Запрос.УстановитьПараметр("ПоказыватьТолькоХарактеристикиВНаличии", СтруктураПараметров.ТолькоОстатки);
		Запрос.УстановитьПараметр("ТорговыйОбъект", СтруктураПараметров.ТорговыйОбъект);
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура",
			"ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
			|		ПО СопутствующиеТовары.СопутствующийТовар = ТаблицаОстатки.Номенклатура
			|			И СопутствующиеТовары.ХарактеристикаСопутствующегоТовара = ТаблицаОстатки.Характеристика");
			
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"И ЦеныНоменклатуры.Актуальность",
			"И ЦеныНоменклатуры.Актуальность
			|	И ВЫБОР
			|		КОГДА &ПоказыватьТолькоХарактеристикиВНаличии
			|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.Количество, 0) > 0
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ");
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
		|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад
		|ПОМЕСТИТЬ ТаблицаСклады
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
		|ГДЕ
		|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиТоваров.Количество) КАК Количество,
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура
		|	,ОстаткиТоваров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|ГДЕ
		|	ОстаткиТоваров.СтруктурнаяЕдиница В
		|			(ВЫБРАТЬ
		|				ТаблицаСклады.Склад КАК Склад
		|			ИЗ
		|				ТаблицаСклады КАК ТаблицаСклады)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура
		|	,ОстаткиТоваров.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|	,Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + Запрос.Текст;
		
		Если Не ИспользоватьХарактеристики Тогда
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				"И СопутствующиеТовары.ХарактеристикаСопутствующегоТовара = ТаблицаОстатки.Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",ОстаткиТоваров.Характеристика КАК Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",ОстаткиТоваров.Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",Характеристика",
				"");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяКатегория", Справочники.КатегорииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦены", СтруктураПараметров.ВидЦены);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

// Заполнение признака "ЕстьСопутствующиеТовары" для таблицы Товары в РМК,
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - данные формы РМК.
//
Процедура ЗаполнитьПризнакНаличияСопутсвующихТоваровРМК(Форма) Экспорт
	
	Объект                  = Форма.Объект;
	УчитыватьХарактеристики = Форма.УчитыватьХарактеристикиПриПодбореСопутствующихТоваров;
	РозничныйВидЦены        = Форма.РозничныйВидЦены;
	ТолькоОстатки           = Форма.ор_ПоказыватьТолькоХарактеристикиВНаличии;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СопутствующиеТовары.Номенклатура КАК Номенклатура,
	|	СопутствующиеТовары.Характеристика КАК Характеристика,
	|	СопутствующиеТовары.СопутствующийТовар КАК СопутствующийТовар
	|ИЗ
	|	РегистрСведений.СопутствующиеТовары КАК СопутствующиеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	(СопутствующиеТовары.Номенклатура, СопутствующиеТовары.Характеристика) В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|				,Товары.Характеристика
	|			ИЗ
	|				Товары КАК Товары)
	|	И ЦеныНоменклатуры.Период <= &Дата
	|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
	|	И ЦеныНоменклатуры.Актуальность");
	
	Если Не УчитыватьХарактеристики Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ", СопутствующиеТовары.Характеристика", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ",Товары.Характеристика", "");
	КонецЕсли;
	
	Если ТолькоОстатки Тогда
		
		Запрос.УстановитьПараметр("ПоказыватьТолькоХарактеристикиВНаличии", ТолькоОстатки);
		Запрос.УстановитьПараметр("ТорговыйОбъект", Форма.Объект.ТорговыйОбъект);
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура",
			"ПО СопутствующиеТовары.СопутствующийТовар = ЦеныНоменклатуры.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
			|		ПО СопутствующиеТовары.СопутствующийТовар = ТаблицаОстатки.Номенклатура
			|			И СопутствующиеТовары.ХарактеристикаСопутствующегоТовара = ТаблицаОстатки.Характеристика");
			
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"И ЦеныНоменклатуры.Актуальность",
			"И ЦеныНоменклатуры.Актуальность
			|	И ВЫБОР
			|		КОГДА &ПоказыватьТолькоХарактеристикиВНаличии
			|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.Количество, 0) > 0
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ");
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
		|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад
		|ПОМЕСТИТЬ ТаблицаСклады
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
		|ГДЕ
		|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиТоваров.Количество) КАК Количество,
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура
		|	,ОстаткиТоваров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|ГДЕ
		|	ОстаткиТоваров.СтруктурнаяЕдиница В
		|			(ВЫБРАТЬ
		|				ТаблицаСклады.Склад КАК Склад
		|			ИЗ
		|				ТаблицаСклады КАК ТаблицаСклады)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура
		|	,ОстаткиТоваров.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|	,Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + Запрос.Текст;
		
		Если Не УчитыватьХарактеристики Тогда
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				"И СопутствующиеТовары.ХарактеристикаСопутствующегоТовара = ТаблицаОстатки.Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",ОстаткиТоваров.Характеристика КАК Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",ОстаткиТоваров.Характеристика",
				"");
			Запрос.Текст = СтрЗаменить(
				Запрос.Текст,
				",Характеристика",
				"");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦены", РозничныйВидЦены);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
		Если УчитыватьХарактеристики Тогда
			СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
		КонецЕсли;
		
		Строка.ор_ЕстьСопутствующиеТовары = ТаблицаРезультат.НайтиСтроки(СтруктураПоиска).Количество() > 0;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
